{
  "modal": {
    "howItFeels": "How It Feels To Be At This Level:",
    "whatToDo": "What You Need To Do At This Level:",
    "whatYouLearn": "What You Will Learn At This Level:",
    "keySkills": "Key Skills:",
    "requirements": "Requirements to achieve this level:"
  },
  "levels": {
    "A0 Absolute Beginner": {
      "title": "A0 - Absolute Beginner",
      "timeRange": "0-2 hours",
      "description": "Starting your English journey from the very beginning.",
      "howItFeels": "English sounds completely alien to you. None of it feels or sounds familiar to your ears. You're not confident with even the most basic words like I, you, he, she. Even simple phrases like \"How are you\" are not familiar to you.",
      "whatToDo": "The only thing you need to do right now is listen! The A0 videos on Englishsponge have been designed for students who know absolutely zero English, so watch these videos for a couple of hours until you reach the A1 level. These A0 videos use lots of images and gestures so that you can understand them without knowing any English. We do NOT recommend that you start speaking, reading or writing at this stage. It's worth noting that many students have already reached an A1 beginner level from what they learned at school as a child. If the A0 beginner videos seem too easy for you then it's ok to skip ahead of the A1 beginner level.",
      "whatYouLearn": "At this level you learn basic words like I, you, he and she. You also learn the most foundational verbs such as want, like, have and so on. Finally, you will also learn a few basic nouns at this stage like some colours (blue, yellow, red), the names of some foods (pizza, bread, milk) and the names of some animals (dog, cat, fish).",
      "requirements": [
        "Learn basic greetings and introductions",
        "Master the English alphabet and numbers",
        "Understand simple present tense",
        "Build vocabulary of 300+ common words",
        "Complete basic listening exercises"
      ],
      "skills": "Basic communication, simple vocabulary, present tense understanding"
    },
    "A1 Beginner": {
      "title": "A1 - Beginner",
      "timeRange": "2-50 hours",
      "description": "Building fundamental English communication skills.",
      "howItFeels": "As an A1 beginner you have learnt some basic words, but you do not understand how to form complete sentences. All of the language still seems very new and alien to you. You will now know a few key phrases like \"how are you?\" and \"what is your name?\" but you cannot understand a conversation beyond this point.",
      "whatToDo": "The only thing you need to do right now is listen! The A1 beginner videos on Englishsponge have been designed so that you can listen and learn vocabulary from them even as a beginner. Here you will learn your first 200-500 words by listening - learning them by listening ensures that you learn the correct pronunciation for these common and fundamental words. Here, most students try to memorise the colours, numbers, animals and foods and so on. This is wrong (and boring). Instead, just watch our A1 beginner videos and you'll learn all of these things naturally as they come up throughout the videos. We do NOT recommend that you start speaking, reading or writing at this stage.",
      "whatYouLearn": "At the A1 beginner level you will learn basic verbs such as: see, go, drink, eat and bring. You will also learn some basic nouns such as table, pen, cup and tree. You will learn basic adjectives like: happy, sad, hot and cold. The \"function words\", such as him, her, about, from, to and with will still be confusing to you at this stage. This is completely normal.",
      "requirements": [
        "Engage in simple conversations",
        "Use past and future tenses correctly",
        "Expand vocabulary to 800+ words",
        "Read simple texts and stories",
        "Write basic sentences and paragraphs"
      ],
      "skills": "Simple conversations, basic tenses, expanded vocabulary"
    },
    "A2 Upper Beginner": {
      "title": "A2 - Upper Beginner",
      "timeRange": "50-250 hours",
      "description": "Developing more confident communication abilities.",
      "howItFeels": "As an A2 beginner you're now quite familiar with some of the most common words in English. You comfortably understand basic verbs like want, see, watch, eat, drink and run. You are now somewhat familiar with how the English language sounds, and you have built up a vocabulary of around 200-500 words that you know well and another 500 or so words that you vaguely understand. You don't feel like a complete beginner anymore, but you still probably don't feel confident in understanding English yet. That's perfectly normal.",
      "whatToDo": "The only thing you need to do right now is listen! On Englishsponge, you can watch hundreds of videos designed for A2 upper-beginner students. All you need to do is watch them, and build up your vocabulary through watching comprehensible input. By learning English in this way, you are building up a fantastic foundation of good pronunciation and natural sounding English. We do NOT recommend that you start speaking, reading or writing at this stage.",
      "whatYouLearn": "You'll continue to build up your vocabulary through watching comprehensible input videos until you've learnt roughly 1500-2500 words in English. You'll learn the future simple and past simple tenses at this stage - not from studying grammar, but through watching videos. The \"function words\", such as him, her, about, from, to and with will still be confusing to you at this stage. This is completely normal.",
      "requirements": [
        "Handle routine tasks and social situations",
        "Use conditional and perfect tenses",
        "Master 1500+ vocabulary words",
        "Understand longer conversations",
        "Write coherent short texts"
      ],
      "skills": "Routine communication, complex tenses, intermediate vocabulary"
    },
    "B1 Intermediate": {
      "title": "B1 - Intermediate",
      "timeRange": "250-400 hours",
      "description": "Achieving functional independence in English.",
      "howItFeels": "Good job! You're officially an intermediate English learner! Now that you're a B1 student of English you have built a solid foundation of English and you'll likely be starting to feel some confidence when interacting with the language. You may find that listening to English has started to become a little bit more enjoyable as you can now understand slightly more complex topics. For many, B1 is the \"magic\" level where they start to feel more comfortable with English and listening no longer feels like such hard work for your brain.",
      "whatToDo": "The main thing that you need to do as a B1 English learner is keep listening to comprehensible input videos at the B1 level. This should continue to be your top priority above all else. At this stage you can begin to speak if you wish. Of course, it will still feel difficult as you begin to speak for the first time. However, you may be surprised by how quickly you learn to speak English because you already have so much vocabulary in your head that you understand from listening to so much comprehensible input.",
      "whatYouLearn": "You will continue to build your vocabulary more and more as you continue watching comprehensible input videos. In order to reach the B2 level, you'll need to build a vocabulary of roughly 4000 words in English. You'll improve your understanding of the present perfect tense and the past simple tense at this level and you'll start to learn about some slightly more advanced grammar structures.",
      "requirements": [
        "Discuss abstract topics and opinions",
        "Use all major grammar structures",
        "Command 3000+ vocabulary words",
        "Follow detailed presentations",
        "Write structured essays and reports"
      ],
      "skills": "Abstract discussions, advanced grammar, extensive vocabulary"
    },
    "B1.5 Upper-Intermediate": {
      "title": "B1.5 - Intermediate",
      "timeRange": "400-600 hours",
      "description": "Bridging the gap between intermediate and advanced English.",
      "howItFeels": "Alright, now we're at the half-way point between the B1 Intermediate and B2 upper-intermediate levels. Your confidence and comfort with English will have built substantially by now. You still won't be 100% comfortable with English, but if somebody asks you: \"Do you know English?\" You begin to feel confident in saying \"Yes, I know English\".",
      "whatToDo": "You will continue to build your vocabulary more and more as you continue watching comprehensible input videos. In order to reach the B2 level, you'll need to build a vocabulary of roughly 4000 words in English. Your main priority at this level should be to keep watching lots and lots of comprehensible input at the B1 level, until you can understand the B2 level videos on Englishsponge.",
      "whatYouLearn": "You'll continue working towards the roughly 4000 words in English you'll need to reach the B2 level. Through watching massive amounts of comprehensible input your vocabulary will increase over time. You'll begin to feel comfortable with some more advanced tenses like the past perfect or 2nd conditional tense.",
      "requirements": [
        "Handle complex conversations with confidence",
        "Understand most TV shows and movies",
        "Expand vocabulary to 5000+ words",
        "Use advanced grammar structures naturally",
        "Read intermediate-level texts fluently"
      ],
      "skills": "Complex conversations, natural grammar usage, extensive vocabulary"
    },
    "B2 Upper-Intermediate": {
      "title": "B2 - Upper-Intermediate",
      "timeRange": "600-1000 hours",
      "description": "Mastering advanced English for professional use.",
      "howItFeels": "Congratulations! You've made it to the B2 upper-intermediate level! You are now a competent English learner. You will feel as though you can finally use the language for real. At this stage, you'll often be able to understand a native English speaker talking to you at nearly full speed. Although listening to conversations between 2 or more native English speakers will still be a challenge.",
      "whatToDo": "First and foremost, you need to keep listening to massive amounts of comprehensible input at the B2 level, especially at the early stages. Our EnglishSponge B2 videos are designed to help you bridge the gap from content made for learners and normal English content made for native speakers.",
      "whatYouLearn": "You'll continue working towards the roughly 8000 words in English you'll need to reach the C1 level. You'll learn this through continuing to watch EnglishSponge comprehensible input as well as native media like TV series. You'll start to become confident with more advanced grammar structures such as the 3rd conditional and the future perfect.",
      "requirements": [
        "Engage in complex debates and negotiations",
        "Use sophisticated grammar naturally",
        "Master 5000+ vocabulary words",
        "Understand native-speed conversations",
        "Write professional documents"
      ],
      "skills": "Complex communication, natural grammar usage, professional vocabulary"
    },
    "C1 Advanced": {
      "title": "C1 - Advanced",
      "timeRange": "1000+ hours",
      "description": "Achieving near-native proficiency in English.",
      "howItFeels": "Amazing! You have reached a level that most English learners will never reach. This is a fantastic achievement and it probably took a lot of practice. Great job! You are now able to understand all kinds of native media: movies, TV shows, the news, Youtube videos and so on. Of course, you will still occasionally come across vocabulary that you don't understand, but for the most part you can generally understand what's going on in most forms of native media.",
      "whatToDo": "Continue listening to massive amounts of comprehensible input through both listening and reading. EnglishSponge B2 level videos will be too easy for you at this stage. However, there can be a lot of benefit of sometimes listening to content that's below your level, as it allows you to focus more on the finer details of the language.",
      "whatYouLearn": "At this level, you'll continue to increase the range of phrasal verbs and idioms that you can use. You'll also learn more and more topic-specific vocabulary (Eg. vocabulary about marketing, sailing, football etc.). You'll start to get more comfortable with certain types of slang. You'll finally start to get to grips with a lot of the function words that have been tripping you up all this time.",
      "requirements": [
        "Engage in sophisticated academic discussions",
        "Understand complex texts and literature",
        "Master 8000+ vocabulary words",
        "Use language with near-native fluency",
        "Write professional and academic documents"
      ],
      "skills": "Near-native fluency, sophisticated expression, cultural understanding"
    }
  }
}
